#### 데이터프레임 그룹 분석

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

##### pivot 메서드

In [11]:
data = {
     "도시":["서울","서울","서울","부산","부산","부산","인천","인천"],
     "연도":["2015","2010","2005","2015","2010","2005","2015","2010"],
     "인구":[9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 2632035]     
 }
 
columns = ["도시","연도","인구"]
df1 = pd.DataFrame(data=data, columns=columns)
print(df1)

   도시    연도       인구
0  서울  2015  9904312
1  서울  2010  9631482
2  서울  2005  9762546
3  부산  2015  3448737
4  부산  2010  3393191
5  부산  2005  3512547
6  인천  2015  2890451
7  인천  2010  2632035

In [12]:
df1.columns

Index(['도시', '연도', '인구'], dtype='object')

In [13]:
def cityToMetro(c):
    if(c in ["서울", "인천"]): return "수도권"
    elif(c in ["부산"]): return "경상권"

In [14]:
df1["지역"] = df1.apply(lambda x : cityToMetro(x["도시"]), axis=1)

In [15]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [16]:
# 행 인덱스, 열 인덱스, 데이터
df1.pivot(index='도시', columns='연도', values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

In [17]:
df1.pivot(index=['지역','도시'], columns='연도', values='인구')

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN  2632035.0  2890451.0